app/Http/Controllers/PagesController.php

    public function get_mod_list_info()
    {
        $mod = ModProduct::orderBy('mod_number','DESC')->get();
        $list = ListProduct::orderBy('list_number','DESC')->get();
---
select * from `modproducts` order by `mod_number` desc
select * from `listproducts` order by `list_number` desc

    public function getproduct_in_category($mod_slug,$list_slug =null)
    {
        if ($list_slug != null) {
            $mod = ModProduct::where('mod_slug',$mod_slug)->first();
            $list = ListProduct::where('list_slug',$list_slug)->where('id_mod',$mod->id)->first();
            $data = Product::where('list_id',$list->id)->orderBy('pro_view','DESC')->paginate(12);
        }else {
            $mod = ModProduct::where('mod_slug',$mod_slug)->first();
            $list = ListProduct::where('id_mod',$mod->id)->pluck('id');
---
select `id` from `listproducts` where `id_mod` = '3'

    public function index_product()
    {

        $pro_arr = array( );

        $mod = ModProduct::get();
        foreach ($mod as $key) {
            $list_arr = ListProduct::where('id_mod',$key->id)->pluck('id');
            $pro[0] = $key->id;
            $pro[1] = Product::whereIn('list_id',$list_arr)->orderBy('pro_view','DESC')->take(8)->get();
---
select * from `modproducts`
select * from `products` where `list_id` in ('15', '16') order by `pro_view` desc limit 8

    public function api_detail_pro($pro_id,$pro_slug)
    {
        $pro = Product::where('id',$pro_id)->where('pro_slug',$pro_slug)->first();
        $list = ListProduct::find($pro->list_id);
        $list_arr = ListProduct::where('id_mod',$list->id_mod)->pluck('id');
        $new_pro = Product::wherein('list_id',$list_arr)->where('id','<>',$pro->id)->orderBy('created_at','DESC')->take(10)->get();
---
select * from `products` where `id` = '22' and `pro_slug` = 'dien-thoai-samsung-galaxy-s9-128gb' limit 1
select * from `listproducts` where `listproducts`.`id` = '10' limit 1
select `id` from `listproducts` where `id_mod` = '17'
select * from `products` where `list_id` in ('9', '10', '11', '12') and `id` <> '22' order by `created_at` desc limit 10